1сУчетОборудования/Documents/ПередачаОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПередачаОборудования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиОборудования</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникОт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКому</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникКому</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйОбъект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвентарныеОбъекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1сУчетОборудования/AccumulationRegisters/ОстаткиОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиОборудования</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураОборудования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвентарныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1сУчетОборудования/Enums/СтатусОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВЭксплуатации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРемонте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1сУчетОборудования/Documents/ПередачаОборудования/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Попытка
		
		
        Движения.ОстаткиОборудования.Записывать = Истина;

        Для Каждого Строка Из Оборудование Цикл

            // 1️⃣ Проверка объекта
            Если Строка.ИнвентарныйОбъект = Неопределено Тогда
                ВызватьИсключение "Не выбран инвентарный объект!";
            КонецЕсли;

            // Получаем объект
            Объект = Строка.ИнвентарныйОбъект.ПолучитьОбъект();

            Если Объект.Номенклатура = Неопределено Тогда
                ВызватьИсключение 
                "У инвентарного объекта не заполнена номенклатура!";
            КонецЕсли;

            // 2️⃣ Расход
            ДвижениеРасход = Движения.ОстаткиОборудования.Добавить();
            ДвижениеРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
            ДвижениеРасход.Период = Дата;
            ДвижениеРасход.ИнвентарныйОбъект = Строка.ИнвентарныйОбъект;
            ДвижениеРасход.Номенклатура = Объект.Номенклатура;
            ДвижениеРасход.Подразделение = ПодразделениеОт;
            ДвижениеРасход.Сотрудник = СотрудникОт;
            ДвижениеРасход.Количество = 1;

            // 3️⃣ Приход
            ДвижениеПриход = Движения.ОстаткиОборудования.Добавить();
            ДвижениеПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
            ДвижениеПриход.Период = Дата;
            ДвижениеПриход.ИнвентарныйОбъект = Строка.ИнвентарныйОбъект;
            ДвижениеПриход.Номенклатура = Объект.Номенклатура;
            ДвижениеПриход.Подразделение = ПодразделениеКому;
            ДвижениеПриход.Сотрудник = СотрудникКому;
            ДвижениеПриход.Количество = 1;

            // 4️⃣ Обновляем статус
            Объект.Статус = Перечисления.СтатусОборудования.ВЭксплуатации;
            Объект.Записать();

        КонецЦикла;

    Исключение
        Отказ = Истина;
        Сообщить("Ошибка проведения: " + ОписаниеОшибки());
    КонецПопытки;
	
КонецПроцедуры
